# SetLBColumnOwnerDrawnType

## Description
Sets the list browser column's owner drawn type.

```pascal
FUNCTION SetLBColumnOwnerDrawnType(
				dialogID       : LONGINT;
				componentID    : LONGINT;
				itemIndex      : INTEGER;
				subItemIndex   : INTEGER;
				ownerDrawnType : INTEGER): BOOLEAN;
```

```python
def vs.SetLBColumnOwnerDrawnType(dialogID, componentID, itemIndex, subItemIndex, ownerDrawnType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|itemIndex|INTEGER|the row index|
|subItemIndex|INTEGER|the column index|
|ownerDrawnType|INTEGER|None - 0, Solid rect - 1, Dual solid rect - 2, Pattern rect - 3, Dual pattern rect - 4, Gradient or image - 5, Blank - 6, Text - 7, Dashed line - 8|

## Remarks
(\_c\_, 2015.12.19):
Pattern and pattern rects are supported starting with VW 15 (2010). Use SetLBItemPatternIndex to choose the Pattern.

(\_c\_, 2007.05.16):
Pattern and pattern rect are not quite supported under VW 12.5 and 12.5.1. Setting a LB cell to this type will only load the artifact of a pattern. The image loaded is by default random and stretches on Mac (not on PC). A pattern shouldn't stretch according to the width of the LB cell, should be bound to the screen resolution.

There is to my knowledge no way to control the pattern loaded.
A corresponding function for setting or retriving the pattern index is still missing in the currently published VS version. In the SDK there are [[SDK:GS_SetListBrowserItemPatternIndex]] and [[SDK:GS_GetListBrowserItemPatternIndex]].

## Examples
```pascal
								TRUE);
			Red := ((TempColorArray [RowCount+1].Red))/257;
			Green := ((TempColorArray [RowCount+1].Green))/257;
			Blue := ((TempColorArray [RowCount+1].Blue))/257;
			bFlipTexture := SetLBColumnOwnerDrawnType( dialog, kFrntMltColBrowser, RowCount,2,1);
			bFlipTexture := SetLBItemFillBackColor( dialog, kFrntMltColBrowser, RowCount,2,Red,Green,Blue);
			bFlipTexture := SetLBItemFillForeColor( dialog, kFrntMltColBrowser, RowCount,2,Red,Green,Blue);
{This line caused crash:  IF IsUserColor(ColorIndexForName,ColorName) then Begin End;}
```
```python
import vs

# Sets the list browser column's owner drawn type.
dialogID = 1
componentID = 2
itemIndex = 1
subItemIndex = 1
ownerDrawnType = 0

ok = vs.SetLBColumnOwnerDrawnType(dialogID, componentID, itemIndex, subItemIndex, ownerDrawnType)
if ok:
    vs.Message('SetLBColumnOwnerDrawnType succeeded')
else:
    vs.Message('SetLBColumnOwnerDrawnType failed')
```

## Version
Availability: from VectorWorks 12.0

## Category
* Dialogs - Modern - Browser